stm32-rs/stm32l4xx-hal/src/serial.rs
                    // Enable One bit sampling method

                    // TODO: Re-enable and fix for conditional LPUART1
                    //usart.cr3.modify(|_, w| w.onebit().set_bit());

                    // Configure parity and word length
                    // Unlike most uart devices, the "word length" of this usart device refers to
                    // the size of the data plus the parity bit. I.e. "word length"=8, parity=even
                    // results in 7 bits of data. Therefore, in order to get 8 bits and one parity
                    // bit, we need to set the "word" length to 9 when using parity bits.
                    let (word_length, parity_control_enable, parity) = match config.parity {
                        Parity::ParityNone => (false, false, false),
                        Parity::ParityEven => (true, true, false),
                        Parity::ParityOdd => (true, true, true),
                    };
                    usart.cr1.modify(|_r, w| {
                        w
                            .m0().bit(word_length)
                            .ps().bit(parity)
                            .pce().bit(parity_control_enable)
                    });

                    unsafe{
                        let asdf = $crate::pac::Peripherals::steal();
                        asdf.RCC.ccipr.modify(|r,w| w.lpuart1sel().bits(0b10));
                    }

                    // Configure stop bits
                    let stop_bits = match config.stopbits {
                        StopBits::STOP1 => 0b00,
                        StopBits::STOP0P5 => 0b01,
                        StopBits::STOP2 => 0b10,
                        StopBits::STOP1P5 => 0b11,
                    };
                    usart.cr2.modify(|_r, w| {
                        w.stop().bits(stop_bits);

                        // Setup character match (if requested)
                        if let Some(c) = config.character_match {
                            w.add().bits(c);
                        }

                        if config.receiver_timeout.is_some() {
                            // TODO: Re-enable and fix for conditional LPUART1
                            // w.rtoen().set_bit();
                        }

                        w
                    });
                    usart.cr1.modify(|_r, w| {w.uesm().bit(true)});
                    unsafe{
                        usart.cr3.modify(|_r, w| {w.wus().bits(0b11)});
                    }


                    // UE: enable USART
                    // RE: enable receiver
                    // TE: enable transceiver
                    usart
                        .cr1
                        .modify(|_, w| w.ue().set_bit().re().set_bit().te().set_bit());

                    Serial { usart, pins }
                }

                pub fn transmitting(&self) -> bool {
                    !self.usart.isr.read().tc().bit()
                }

                pub fn receiving(&self) -> bool {
                    self.usart.isr.read().busy().bit()
                }

                fn rx_set_enabled(&mut self, en: bool) {
                    let usart = unsafe{ &(*$USARTX::ptr()) };
                    usart.cr1.modify(|r,w| w.re().bit(en));
                }

                pub fn rx_enable(&mut self) {
                    self.rx_set_enabled(true)
                }

                pub fn rx_disable(&mut self) {
                    self.rx_set_enabled(false)
                }

                fn tx_set_enabled(&mut self, en: bool) {
                    let usart = unsafe{ &(*$USARTX::ptr()) };
                    usart.cr1.modify(|r,w| w.te().bit(en));
                }

                pub fn tx_enable(&mut self) {
                    self.tx_set_enabled(true)
                }

                pub fn tx_disable(&mut self) {
                    self.tx_set_enabled(false)
                }

                /// Starts listening for an interrupt event
                pub fn listen(&mut self, event: Event) {
                    match event {
                        Event::Rxne => {
                            self.usart.cr1.modify(|_, w| w.rxneie().set_bit())
                        },
                        Event::Txe => {
                            self.usart.cr1.modify(|_, w| w.txeie().set_bit())
                        },
                        Event::Idle => {
                            self.usart.cr1.modify(|_, w| w.idleie().set_bit())
                        },
                        Event::CharacterMatch => {
                            self.usart.cr1.modify(|_, w| w.cmie().set_bit())
                        },
                        Event::ReceiverTimeout => {
                            // TODO: Re-enable and fix for conditional LPUART1
                            // self.usart.cr1.modify(|_, w| w.rtoie().set_bit())
                        },
                    }
                }

                /// Stops listening for an interrupt event
                pub fn unlisten(&mut self, event: Event) {
                    match event {
                        Event::Rxne => {
                            self.usart.cr1.modify(|_, w| w.rxneie().clear_bit())
                        },
                        Event::Txe => {
                            self.usart.cr1.modify(|_, w| w.txeie().clear_bit())
                        },
                        Event::Idle => {
                            self.usart.cr1.modify(|_, w| w.idleie().clear_bit())
                        },
                        Event::CharacterMatch => {
                            self.usart.cr1.modify(|_, w| w.cmie().clear_bit())
                        },
                        Event::ReceiverTimeout => {
                            // TODO: Re-enable and fix for conditional LPUART1
                            // self.usart.cr1.modify(|_, w| w.rtoie().clear_bit())
                        },
                    }
                }

                /// Splits the `Serial` abstraction into a transmitter and a receiver half
                pub fn split(self) -> (Tx<$USARTX>, Rx<$USARTX>) {
                    (
                        Tx {
                            _usart: PhantomData,
                        },
                        Rx {
                            _usart: PhantomData,
                        },
                    )
                }

                /// Frees the USART peripheral
                pub fn release(self) -> ($USARTX, PINS) {
                    (self.usart, self.pins)
                }
            }

            impl<PINS> serial::Read<u8> for Serial<$USARTX, PINS> {
                type Error = Error;

